{"pages":[{"title":"个人简介","text":"大家好，我是钟善男。","link":"/about/index.html"},{"title":"分类","text":"","link":"/categories/index.html"},{"title":"标签","text":"","link":"/tags/index.html"}],"posts":[{"title":"多模态虚假新闻检测 初探索","text":"本周从柳老师处接过一个新课题——多模态虚假新闻检测，接过这个课题的时候我其实就在思考其意义，因为本科毕设是围绕网络舆情来做的，以微博百万数据做支持，通过分析主题和情感演化趋势来判断舆情传播特征及规律。而虚假新闻这个主体不同的是，它是在文本内部作一个分类，但是这个“虚假”性如何去判断，如何划分一篇新闻是真实的还是虚假的，这个划分标准又在哪里；另外多模态这个概念我也是不明确的，因此我当时头脑中冒出很多疑问。 问题解答 据统计 18 年国际期刊《科学》指出，在 2016 年美国总统大选期间，平均每个选民每天要接触 4 篇假新闻，研究认为这些虚假新闻甚至影响了选举的结果。互联网虚假信息正在威胁着全球互联网的安全，如何快速的辨别出虚假新闻，成为一项挑战。 新闻的多模态内容，即包括文本、配图、用户特征等形式，根据这些内容来判断该新闻属于虚假新闻还是真实新闻。 虚假新闻的类型都不同。有的虚假新闻篡改了图片，有虚假新闻会对图片进行错误解读，还有的虚假新闻是将以前的图片拿出来充当当前新闻的配图。 比赛方向 同时，我关注到一些虚假新闻检测挑战赛[1]，这些比赛的方向大致分为三类： 1、给定一个新闻事件的文本，要求参赛者判定该事件属于真实新闻还是虚假新闻； 2、给定一张图片，要求参赛者判断该图片属于虚假新闻图片还是真实新闻图片； 3、给定一条新闻的多模态内容（包括文本、配图、用户特征等），要求参赛者判断该新闻属于虚假新闻还是真实新闻。 上述三条分别对应着文本单模态、图片单模态、图文多模态，我对每个赛题的得分第一的团队解决方案进行了深入了解，每个解决方案背后都有一个完善的模型支撑。 虚假新闻文本检测（单模态）解决方案： 目前虚假新闻识别领域中“数据驱动加知识驱动”的主流研究方向：BERT 预训练模型加强特征校正；科大一团队提出基于 BERT 和 CNN 的多模型虚假新闻分类，将这个任务抽象为 NLP 领域的文本二分类任务，采用多种结构进行融合，在输入上引入字词结合的形式，充分利用假新闻的关键词特征进行优化。 他们在每一个模型的基础上，进行 10 折交叉验证，然后利用假新闻的关键词特征进行优化。对于训练集中的所有假新闻，利用 textrank4zh 对每条新闻文本取 10 个关键词，汇集所有的关键词，得到前 100 个出现最多的关键词。通过观察这些关键词，发现假新闻喜欢对部分人名、地名、名词、动词进行造谣。 同样对测试集中的每条新闻文本取 10 个关键词，汇集所有的关键词，得到前 100 个出现最多的关键词。对这些关键词先去除在训练集中出现较多的，然后按照人名、地名、名词、动词的方式获得以下几类词： 人名：小泽征尔、翁帆、崔永元； 地名：中国、美国、南京、上海、杭州、福建、晋江； 名词：洪水、新闻、遗产、同学、校车、大学、国家； 动词：视察、证实。 因此，某一新闻的前 10 个关键词含有以上这些词时，它有为假新闻的倾向，因此，在模型融合时可以降低真假新闻的分界线。利用这个关键词特征可以发现更多的假新闻，使假新闻评判效果更好 虚假新闻图片检测（单模态）解决方案 第一名的团队通过特征工程的方法，研究了图片的基本特征、图片中的文字特征、PCA 和 SVD 降维特征，以及 DTC 特征等。 基本统计特征：图片尺寸；图片后缀类型；图片模式（RGB、灰度等）；清晰度、亮度；直方图分布特征；各通道的均值方差等统计特征。 特征意义：关键特征包括图片尺寸和清晰度特征；图片尺寸可以识别图片的来源，比如手机截图的尺寸和相机照片尺寸截然不同。 一般认为图像越清晰越是真的，因为图像经过 ps 篡改之后清晰度会下降，还有一种可能性是谣言往往传播得更快，传播过程中的每一次保存和发送都可能会降低清晰度。 降维特征可以在保证维度正常，提取出表征该图片的关键信息。 虚假新闻多模态检测解决方案 冠军团队“Qingbo&amp;bird”通过提出了一个基于 Gdbts-DenseNet-Bert 联合抽取特征的识别模型，实现了准确全面的多模态识别。 面对 38471 条训练样本，他们通过 Python 对原始特征数据以及构造的特征进行了数据分析。 多媒体新闻主要包含三类特征：一个方面是图像特征，训练数据中含有图片的样本占 80% 以上，一个方面是文本特征，还有一个方面是多媒体新闻的发布或者转发者的用户信息特征，比如粉丝数目、关注数、用户简介等用户画像特征。 “Qingbo&amp;bird”团队使用了 GDBT-based 的模型，针对图像特征，将 densent121 预训练模型的最后一个全连接层的输出作为图像的语义特征。针对 text 文本字段，他们利用 tfidf 提取 ngram 特征。 最后，他们把图像、N-Gram 和 Bert 提取的文本特征、用户画像特征拼接到一起，输入 GDBT-based 模型，训练了一个虚假分类的虚假新闻判断模型。 这个模型框架和论文中（EANN 神经网络模型）的一致，研究明白这个框架是极为重要的，下面对该研究框架进行详细说明。 论文框架研究 Event Adversarial Neural Networks(EANN) 对抗事件神经网络 EANN 的框架流程主要分为两条线和三个组件，线其一是文本，线其二是图像，组件分别是多模态特征提取器、虚假新闻检测器和事件鉴别器，分别展开： 多模态特征提取器 多模态特征提取器：对应多模态，数据源包括文本和图像，提取器包括文本特征提取器和视觉特征提取器，作用是对文本和视觉潜在特征进行深度学习，最终连接在一起形成最终的多模态特征表示。 1、分词后的文本。 2、Word Embedding 词嵌入；将单词所属的空间映射到 Y 空间的多维向量，即找到一个映射或者函数，生成文本在一个新的空间上的表达。作用就是进行文本向量化，在我毕设 LDA 与 word2vec 的部分也运用过，NLP 的前期工作都需要向量化的工作，并且这个向量可以通过神经网络的方式来学习更新。 3、Text-CNN 文本分类，通过一维卷积来获取句子中 n-gram 的特征表示。我在本科毕设中使用 LDA 和 doc2vec 进行的固定维度特征向量提取分类，而 Text-CNN 是采用深度学习的方法，在文本分类中效果比 LDA 和 doc2vec 更好。 TextCNN 对文本浅层特征的抽取能力很强，在短文本领域如搜索、对话领域专注于意图分类时效果很好，应用广泛，且速度快，一般是首选；对长文本领域，TextCNN 主要靠 filter 窗口抽取特征，在长距离建模方面能力受限，且对语序不敏感。 总结 学习到这里我深感自己关于深度学习和社交网络的知识储备缺乏，在很多地方会产生原理性的问题，于是我在 coursera 上开始学习吴恩达的机器学习课程，并完成测验。 本周主要对课题的目前研究框架和现状进行了一定的了解，发现了自身缺乏的知识体系，开始计划搭建体系；下周计划在学习机器学习课程的过程中，开始深入阅读几篇文献，后续尝试撰写文献综述。","link":"/2021/07/04/test/"}],"tags":[{"name":"神经网络","slug":"神经网络","link":"/tags/%E7%A5%9E%E7%BB%8F%E7%BD%91%E7%BB%9C/"},{"name":"机器学习","slug":"机器学习","link":"/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"}],"categories":[{"name":"多模态虚假新闻检测","slug":"多模态虚假新闻检测","link":"/categories/%E5%A4%9A%E6%A8%A1%E6%80%81%E8%99%9A%E5%81%87%E6%96%B0%E9%97%BB%E6%A3%80%E6%B5%8B/"}]}